In [1]:
#Something Extra to practice numpy :)

#https://becominghuman.ai/an-essential-guide-to-numpy-for-machine-learning-in-python-5615e1758301

In [1]:
import numpy as np
import pandas as pd

In [2]:
#Any Delimited File, read_csv
employee = pd.read_csv('employee.csv' , sep=',' , header=None)

In [3]:
employee

   0         1     2
0  1  Prashant  1000
1  2      Amar  2000
2  3    Chitra  2000
3  4  Utkarsha  9878
4  5      Ajit  9999

In [8]:
#Any Delimited File, read_csv
employee = pd.read_csv('employee.csv' , sep=',' , header=None , names = ['eid','ename','esal'])

In [9]:
employee

   eid     ename  esal
0    1  Prashant  1000
1    2      Amar  2000
2    3    Chitra  2000
3    4  Utkarsha  9878
4    5      Ajit  9999

In [10]:
empWithHeaders = pd.read_csv('employeeWithHeaders.csv')

In [11]:
empWithHeaders

   eid     ename  esal
0    1  Prashant  1000
1    2      Amar  2000
2    3    Chitra  2000
3    3    Chitra  2000
4    4  Utkarsha  9878
5    5      Ajit  9999

In [88]:
employee.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 5 entries, 0 to 4
Data columns (total 5 columns):
eid                 5 non-null int64
ename               5 non-null object
esal                5 non-null int64
yearlySalary        5 non-null int64
halfYearlySalary    5 non-null int64
dtypes: int64(4), object(1)
memory usage: 280.0+ bytes

In [13]:
type(employee)

pandas.core.frame.DataFrame

# Series

In [15]:
type(employee.eid)

pandas.core.series.Series

In [17]:
employee.ename

0    Prashant
1        Amar
2      Chitra
3    Utkarsha
4        Ajit
Name: ename, dtype: object

In [18]:
employee.eid

0    1
1    2
2    3
3    4
4    5
Name: eid, dtype: int64

In [19]:
#To extract the values from the series -----> numpy array
employee.eid.values

array([1, 2, 3, 4, 5], dtype=int64)

In [21]:
#To Get the unique values from the series
employee.esal.unique()

array([1000, 2000, 9878, 9999], dtype=int64)

# Operations on Series

+,-,*,/,%,**

In [23]:
#yearlySalary
yearlySalary = employee.esal * 12 #Broadcasting
yearlySalary

0     12000
1     24000
2     24000
3    118536
4    119988
Name: esal, dtype: int64

In [25]:
employee['yearlySalary'] = yearlySalary
employee

   eid     ename  esal  yearlySalary
0    1  Prashant  1000         12000
1    2      Amar  2000         24000
2    3    Chitra  2000         24000
3    4  Utkarsha  9878        118536
4    5      Ajit  9999        119988

In [26]:
#Use-case:
# Increment the salary based on the following criteria
# salary is less than equal to 2000 , inc by 10%
# salary is between 2001 and 8999, inc by 5%
# salary is above 8999 , no incr
# Create a new column in my DataFrame called updatedSalary

In [27]:
# Create a function and apply the function to the series
def increMent(sal):
    pass

In [ ]:
employee['updatedSalary'] = employee.esal.apply(increMent)

In [28]:
# Use Lambda Expression
halfYearlySalary = lambda sal: sal * 6

In [29]:
employee['halfYearlySalary'] = employee.esal.apply(halfYearlySalary)
employee

   eid     ename  esal  yearlySalary  halfYearlySalary
0    1  Prashant  1000         12000              6000
1    2      Amar  2000         24000             12000
2    3    Chitra  2000         24000             12000
3    4  Utkarsha  9878        118536             59268
4    5      Ajit  9999        119988             59994

# Traversing the DataFrame

In [30]:
employee

   eid     ename  esal  yearlySalary  halfYearlySalary
0    1  Prashant  1000         12000              6000
1    2      Amar  2000         24000             12000
2    3    Chitra  2000         24000             12000
3    4  Utkarsha  9878        118536             59268
4    5      Ajit  9999        119988             59994

### Using index location to get the subset of the data

In [31]:
# I want to create another dataframe which holds ename(1) and yearlySalary(3)
#iloc ---> IndexLocation
# iloc[row_range or row_list , column_range or column_list]
employee.iloc[:,[1,3]]

      ename  yearlySalary
0  Prashant         12000
1      Amar         24000
2    Chitra         24000
3  Utkarsha        118536
4      Ajit        119988

In [33]:
# I want to create another dataframe which holds ename(1) and yearlySalary(3) with last 3 records
employee.iloc[[2,3,4],[1,3]]

      ename  yearlySalary
2    Chitra         24000
3  Utkarsha        118536
4      Ajit        119988

# Export the dataframe in the form of file

In [34]:
resultDF = employee.iloc[:,[1,3]]

In [35]:
resultDF

      ename  yearlySalary
0  Prashant         12000
1      Amar         24000
2    Chitra         24000
3  Utkarsha        118536
4      Ajit        119988

In [36]:
resultDF.to_csv('result.csv')

In [37]:
resultDF.to_csv('result1.csv' , index= False)

In [41]:
resultDF.to_excel("E:\\result2.xlsx", index= False , sheet_name='ResultFromEmpDF2')

In [44]:
#resultDF.to_sparse('resultDF',fill_value=True)

In [47]:
?pd.DataFrame.to_excel()

In [ ]:
#Link: https://pandas.pydata.org/pandas-docs/stable/

# Comparison Operator Examples

In [48]:
employee

   eid     ename  esal  yearlySalary  halfYearlySalary
0    1  Prashant  1000         12000              6000
1    2      Amar  2000         24000             12000
2    3    Chitra  2000         24000             12000
3    4  Utkarsha  9878        118536             59268
4    5      Ajit  9999        119988             59994

In [49]:
employee.esal > 3000

0    False
1    False
2    False
3     True
4     True
Name: esal, dtype: bool

In [50]:
employee[employee.esal > 3000]

   eid     ename  esal  yearlySalary  halfYearlySalary
3    4  Utkarsha  9878        118536             59268
4    5      Ajit  9999        119988             59994

In [52]:
employee[(employee.esal > 3000) & (employee.esal < 9900)]

   eid     ename  esal  yearlySalary  halfYearlySalary
3    4  Utkarsha  9878        118536             59268

In [53]:
#Select those employees whose sal is greater than 3000 and show only eid and esal
employee[employee.esal > 3000].iloc[:,[0,2]]

   eid  esal
3    4  9878
4    5  9999

In [55]:
employee[employee.esal > 3000][['eid','esal']]

   eid  esal
3    4  9878
4    5  9999

# Creating DataFrame using Lists

In [56]:
list1 = [[1,'Mumbai',1000],[2,'Chennai',3000],[3,'Mumbai',3000],[4,'Bangalore',9000],[4,'Bangalore',9000]]

In [57]:
list1

[[1, 'Mumbai', 1000],
 [2, 'Chennai', 3000],
 [3, 'Mumbai', 3000],
 [4, 'Bangalore', 9000],
 [4, 'Bangalore', 9000]]

In [58]:
dfData = pd.DataFrame(list1)
dfData

   0          1     2
0  1     Mumbai  1000
1  2    Chennai  3000
2  3     Mumbai  3000
3  4  Bangalore  9000
4  4  Bangalore  9000

In [59]:
dfData.columns = ['eid','ecity','esal']
dfData

   eid      ecity  esal
0    1     Mumbai  1000
1    2    Chennai  3000
2    3     Mumbai  3000
3    4  Bangalore  9000
4    4  Bangalore  9000

# Deal with Duplicate columns in Pandas

In [63]:
#For Row data
dfData.drop_duplicates(inplace=True)

In [64]:
dfData

   eid      ecity  esal
0    1     Mumbai  1000
1    2    Chennai  3000
2    3     Mumbai  3000
3    4  Bangalore  9000

In [65]:
#Re-assignment
dfData = dfData.drop_duplicates()

In [66]:
dfData

   eid      ecity  esal
0    1     Mumbai  1000
1    2    Chennai  3000
2    3     Mumbai  3000
3    4  Bangalore  9000

# Combine and Merge in DataFrame

In [67]:
dfData2 = pd.DataFrame([[1,'Engineering'],[2,'HR'],[3,'Operations'],[4,'Operations']] , columns=['id','dept'])
dfData2

   id         dept
0   1  Engineering
1   2           HR
2   3   Operations
3   4   Operations

## Use concat functn
Columnwise concatenation

In [69]:
resultDF1 = pd.concat([dfData,dfData2] , axis=1)
resultDF1

   eid      ecity  esal  id         dept
0    1     Mumbai  1000   1  Engineering
1    2    Chennai  3000   2           HR
2    3     Mumbai  3000   3   Operations
3    4  Bangalore  9000   4   Operations

Rowwise concatenation

In [72]:
dfRecord = pd.DataFrame([[5,'Mumbai',5000]] , columns=['eid','ecity','esal'])
dfRecord

   eid   ecity  esal
0    5  Mumbai  5000

In [74]:
resultDF2 = pd.concat([dfData,dfRecord] , axis=0) #Logically has same column name . thus supported !!!
resultDF2

   eid      ecity  esal
0    1     Mumbai  1000
1    2    Chennai  3000
2    3     Mumbai  3000
3    4  Bangalore  9000
0    5     Mumbai  5000

In [76]:
dfRecord1 = pd.DataFrame([[6,'Mumbai',5000]] , columns=['eid','city','esal'])
dfRecord1

   eid    city  esal
0    6  Mumbai  5000

In [77]:
resultDF3 = pd.concat([dfData,dfRecord1] , axis=0)
resultDF3

     city      ecity  eid  esal
0     NaN     Mumbai    1  1000
1     NaN    Chennai    2  3000
2     NaN     Mumbai    3  3000
3     NaN  Bangalore    4  9000
0  Mumbai        NaN    6  5000

# Merging based on common column

In [78]:
employee

   eid     ename  esal  yearlySalary  halfYearlySalary
0    1  Prashant  1000         12000              6000
1    2      Amar  2000         24000             12000
2    3    Chitra  2000         24000             12000
3    4  Utkarsha  9878        118536             59268
4    5      Ajit  9999        119988             59994

In [79]:
departments = pd.read_csv('departments.csv')

In [80]:
departments

   eid    deptname
0    1  Operations
1    2          HR
2    3     Finance
3    4  Operations
4    5          HR

In [81]:
resultDFMerge = pd.merge(employee,departments)
resultDFMerge

   eid     ename  esal  yearlySalary  halfYearlySalary    deptname
0    1  Prashant  1000         12000              6000  Operations
1    2      Amar  2000         24000             12000          HR
2    3    Chitra  2000         24000             12000     Finance
3    4  Utkarsha  9878        118536             59268  Operations
4    5      Ajit  9999        119988             59994          HR

# Merging with logically same column with a different column name

In [83]:
departments.columns = ['empid','deptname']
departments

   empid    deptname
0      1  Operations
1      2          HR
2      3     Finance
3      4  Operations
4      5          HR

In [85]:
resultMerge = pd.merge(employee,departments, left_on='eid', right_on='empid')

   eid     ename  esal  yearlySalary  halfYearlySalary  empid    deptname
0    1  Prashant  1000         12000              6000      1  Operations
1    2      Amar  2000         24000             12000      2          HR
2    3    Chitra  2000         24000             12000      3     Finance
3    4  Utkarsha  9878        118536             59268      4  Operations
4    5      Ajit  9999        119988             59994      5          HR

# Deleting Data

1. We will be using drop() where it only accepts indexes
2. drop with axis = 1 ---- Column drop
3. drop with axis = 0 ---- Row drop
4. Always use inplace once you are satisfied with the output

In [129]:
list1 = [[1,'Mumbai',1000],[2,'Chennai',3000],[3,'Mumbai',3000],[4,'Bangalore',9000],[5,'Bangalore',10000]]
dataDF1 = pd.DataFrame(list1, columns=['eid','ecity','esal'])
dataDF1

   eid      ecity   esal
0    1     Mumbai   1000
1    2    Chennai   3000
2    3     Mumbai   3000
3    4  Bangalore   9000
4    5  Bangalore  10000

Column Deletion

In [114]:
dataDF1.drop(['esal','ecity'], axis = 1) #Column Wise

   eid
0    1
1    2
2    3
3    4
4    5

In [115]:
dataDF1.drop(['esal'], axis = 1) # Use inplace to make it permanent!!!!

   eid      ecity
0    1     Mumbai
1    2    Chennai
2    3     Mumbai
3    4  Bangalore
4    5  Bangalore

Row Deletion

In [117]:
dataDF1.drop([4],axis = 0)

   eid      ecity  esal
0    1     Mumbai  1000
1    2    Chennai  3000
2    3     Mumbai  3000
3    4  Bangalore  9000

In [121]:
#Delete those rows whose salary is greater than 3000

dataDF1.drop(dataDF1[dataDF1.esal > 3000].index , axis = 0)

   eid    ecity  esal
0    1   Mumbai  1000
1    2  Chennai  3000
2    3   Mumbai  3000

# Indexes in Pandas

In [122]:
dataDF1

   eid      ecity   esal
0    1     Mumbai   1000
1    2    Chennai   3000
2    3     Mumbai   3000
3    4  Bangalore   9000
4    5  Bangalore  10000

In [123]:
# Reset the row index
dataDF1.index = np.arange(10,15)
dataDF1

    eid      ecity   esal
10    1     Mumbai   1000
11    2    Chennai   3000
12    3     Mumbai   3000
13    4  Bangalore   9000
14    5  Bangalore  10000

In [124]:
# reset the column index
dataDF1.columns = np.arange(0,3)
dataDF1

    0          1      2
10  1     Mumbai   1000
11  2    Chennai   3000
12  3     Mumbai   3000
13  4  Bangalore   9000
14  5  Bangalore  10000

In [126]:
dataDF1.iloc[:,[1,0,2]]

            1  0      2
10     Mumbai  1   1000
11    Chennai  2   3000
12     Mumbai  3   3000
13  Bangalore  4   9000
14  Bangalore  5  10000

# Group By

In [130]:
dataDF1

   eid      ecity   esal
0    1     Mumbai   1000
1    2    Chennai   3000
2    3     Mumbai   3000
3    4  Bangalore   9000
4    5  Bangalore  10000

In [132]:
dataDF1.groupby('ecity')

In [136]:
result = dataDF1.groupby('ecity').count()

In [138]:
result[result.esal > 1]

           eid  esal
ecity
Bangalore    2     2
Mumbai       2     2

In [135]:
dataDF1.groupby('ecity')['esal'].sum()

ecity
Bangalore    19000
Chennai       3000
Mumbai        4000
Name: esal, dtype: int64